import json
import pandas as pd

specs = ['011', '012', '013', '014', '014-1', '014-178', '014-179', '014-180', '014-181', '014-182', '014-183', '014-184', '014-185', '014-186', '014-3', '014-4', '014-55', '014-6', '014-7', '014-8', '014-9', '014-10', '014-11', '014-12', '014-13', '014-56', '015', '015-192', '015-193', '015-194', '015-195', '015-196', '015-197', '015-198', '015-199', '015-200', '016', '016-187', '016-188', '016-189', '016-190', '016-191', '017', '021', '022', '022-84', '022-85', '022-86', '022-87', '022-88', '023', '024', '025', '026', '027', '028', '029', '031', '032', '033', '034', '035', '035-37', '035-38', '035-57', '035-58', '035-59', '035-60', '035-61', '035-62', '035-63', '035-64', '035-141', '035-65', '035-66', '035-67', '035-68', '035-69', '035-70', '035-71', '035-72', '035-73', '035-74', '035-75', '035-76', '035-77', '035-78', '035-79', '035-80', '035-81', '035-82', '035-83', '035-146', '035-147', '035-44', '035-148', '035-45', '035-46', '041', '051', '052', '053', '054', '061', '071', '072', '073', '075', '076', '081', '091', '101', '102', '103', '104', '105', '106', '111', '112', '113', '121', '122', '123', '124', '125', '126', '131', '132', '133', '134', '135', '136', '141', '142', '143', '144', '145', '151', '152', '153', '161', '162', '163', '171', '172', '173', '181', '182', '183', '184', '185', '186', '187', '191', '192', '193', '194', '201', '202', '203', '204', '205', '206', '207', '208', '211', '212', '221', '222', '223', '224', '225', '226', '227', '227-167', '227-168', '228', '229', '231', '232', '241', '242', '251', '252', '253', '254', '255', '256', '261', '262', '263', '271', '271-163', '271-164', '271-165', '271-166', '272', '273', '274', '275', '275-47', '275-48', '275-49', '275-50', '281', '291', '292', '293']

print('Загрузка файла')
data = json.loads(open('edbo.json', 'r').read())
df_json = pd.json_normalize(data, record_path=['specs', 'students'], meta=['spec_num', 'univer', ['spec', 'price'], ['spec', 'faculty_name'], ['spec', 'offer_id']])

marks = {}
idx = 0

print('Загрузка баллов')
for i in data:
    for z in i['specs']:
        for k in z['students']:
            for p in k['rss']:
                if p.get('id'):
                    if marks.get(idx):
                        marks[idx].append((p['id'], p['b']))
                    else:
                        marks[idx] = [(p['id'], p['b'])]
            idx+=1


st = ['Українська мова', 'Математика', 'Українська мова і література', 'Іноземна мова', 'Історія України', 'Географія', 'Біологія', 'Фізика', 'Хімія', 'Середній бал документа про освіту', 'Бал за успішне закінчення підготовчих курсів закладу освіти', 'Бал за мотиваційний лист', 'Угорська мова', 'Творчий залік', 'Фізична культура', 'Румунська мова', 'Творчий конкурс', 'Англійська мова', 'Захист вітчизни']

for i in marks:
    for z in marks[i]:
        df_json.at[i, z[0]] = z[1]

statuses = {
   "1":"заява надійшла з сайту",
   "2":"затримано",
   "3":"скасовано вступником",
   "4":"скасовано (втрата пріор.)",
   "5":"зареєстровано",
   "6":"допущено",
   "7":"відмова",
   "8":"скасовано ЗО",
   "9":"рекомендовано (бюджет)",
   "10":"відхилено (бюджет)",
   "11":"допущено (контракт, за ріш. ПК)",
   "12":"рекомендовано (контракт)",
   "13":"відхилено (контракт)",
   "14":"до наказу",
   "15":"відраховано",
   "16":"Нет данных"
}

print('Переименовывание статусов')
for k in statuses:
    df_json = df_json.replace({'prsid': int(k)}, statuses[k])

print('Переименовывание колонок')
df_json = df_json.rename(columns={'spec.faculty_name':'Факультет', 'spec.price':'Контракт', 'spec.offer_id':'ID позиции', 'd':'Документы', 'ptid':'Квота', 'fio':'ФИО', 'prsid':'Статус', 'kv':'КБ', 'p':'Приоритет', 'spec_num':'№ Спец', 'univer':'Универ'})
for i in ('prid', 'n', 'pa', 'artid', 'rss'):
    df_json.pop(i)

print('Нормализация колонок с предметами')
cols = df_json.columns.tolist()
for i in [
    ['Українська мова', 11],
    ['Математика', 12],
    ['Українська мова і література', 13],
    ['Іноземна мова', 14],
    ['Історія України', 15],
    ['Географія', 16],
    ['Середній бал документа про освіту', 20]
    ]:
    cols.remove(i[0]);cols.insert(i[1], i[0])
df_json = df_json[cols]
df_json.to_csv("edbo.csv", sep=',', encoding='utf-8')